test/SiStripHistoricInfoClient.xml

<SOAP-ENV:Envelope
   SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>

    <xdaq:Configure xmlns:xdaq="urn:xdaq-soap:3.0">
      <xc:Partition 
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  
       xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
       xmlns:xc="http://xdaq.web.cern.ch/xdaq/xsd/2004/XMLConfiguration-30">
    	 <xc:Context url="http://lxcmse2.cern.ch:1972">
	    
              <!-- SiStripHistoricInfoClient -->
              <xc:Application class="SiStripHistoricInfoClient" id="15" instance="0" network="local">
                  <properties xmlns="urn:xdaq-application:SiStripHistoricInfoClient" xsi:type="soapenc:Struct">
                    <serverHost xsi:type="xsd:string">lxcmse2.cern.ch</serverHost>
                    <serverPort xsi:type="xsd:unsignedLong">9090</serverPort>
                  </properties>
              </xc:Application>
              <xc:Module>/afs/cern.ch/user/d/dkcira/analysis/2006_12_08_client/CMSSW_2006-12-07/lib/slc3_ia32_gcc323/libDQMSiStripHistoricInfoClient.so</xc:Module>

              <!-- TStore -->
              <xc:Application class="TStore" id="120" instance="0" network="local" group="database">
              <properties xmlns="urn:xdaq-application:TStore" xsi:type="soapenc:Struct">
                      <views xsi:type="soapenc:Array" soapenc:arrayType="xsd:ur-type[3]">
                      <item xsi:type="xsd:string" soapenc:position="[0]">sqlview.xml</item>
              </views>
              </properties>
              </xc:Application>
              <xc:Module>${XDAQ_ROOT}/daq/tstore/lib/linux/x86/libtstore.so</xc:Module>

         </xc:Context>
      </xc:Partition>
    </xdaq:Configure>

  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
